In [31]:
# creating an empty dataframe 
import pandas as pd
df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [32]:
# creating dataframe using scalar values in a list
df1 = pd.DataFrame(data=[4,5,6,7], index=range(0,4), columns=['A'])
print(df1)

   A
0  4
1  5
2  6
3  7

In [33]:
# creating dataframe using scalar values in a list
L1=[1,2,3,4,5]
L2=[6,7,8,9,10]
data=[L1,L2]
df1 = pd.DataFrame(data,index=range(0,2), columns=['A','B','C','D','E'])
print(df1)

   A  B  C  D   E
0  1  2  3  4   5
1  6  7  8  9  10

In [34]:
# creating dataframe using scalar values in a list
L1=[1,2,3,4,5]
L2=[6,7,8,9,10]
df1 = pd.DataFrame(data=[L1,L2],index=range(0,2), columns=['A','B','C','D','E'])
print(df1)

   A  B  C  D   E
0  1  2  3  4   5
1  6  7  8  9  10

In [35]:
# creating dataframe from one ndarray
import pandas as pd
import numpy as np
na1=np.array([10,20,30])
na2=np.array([1.5,2.7,3.4])
na3=np.array([5,10,15])
df2=pd.DataFrame(na1)
print(df2)

    0
0  10
1  20
2  30

In [36]:
# creating dataframe from more than one ndarray
df2=pd.DataFrame([na1,na2,na3])
print(df2)

      0     1     2
0  10.0  20.0  30.0
1   1.5   2.7   3.4
2   5.0  10.0  15.0

In [37]:
# creating dataframe from more than one ndarray with column and index names 
df2=pd.DataFrame([na1,na2,na3], columns=["c1","c2","c3"], index=["r1","r2","r3"])
print(df2) # it will print the dataframe with column and index names

      c1    c2    c3
r1  10.0  20.0  30.0
r2   1.5   2.7   3.4
r3   5.0  10.0  15.0

In [38]:
# creating dataframe using list of dictionary without mentioning index
import pandas as pd
l1=[{'Ram': 19,'Tejas': 16,'Arvind':14,'Shagun':12,'Rajesh':17},{'Ram': 78,'Tejas': 89,'Arvind':90,'Shagun':68,'Rajesh':82}]
df3=pd.DataFrame(l1)
print(df3)

   Ram  Tejas  Arvind  Shagun  Rajesh
0   19     16      14      12      17
1   78     89      90      68      82

In [39]:
# creating dataframe using list of dictionary with index
df3=pd.DataFrame(l1,index=['UT1','Term1'])
print(df3)

       Ram  Tejas  Arvind  Shagun  Rajesh
UT1     19     16      14      12      17
Term1   78     89      90      68      82

In [40]:
# creating dataframe using list of dictionary with missing key values
import pandas as pd
l1=[{'Ram': 19,'Tejas': 16,'Shagun':12,'Rajesh':17},{'Ram': 78,'Tejas': 89,'Arvind':90,'Rajesh':82}]
df4=pd.DataFrame(l1, index=['UT1','Term'])
print(df4)

      Ram  Tejas  Shagun  Rajesh  Arvind
UT1    19     16    12.0      17     NaN
Term   78     89     NaN      82    90.0

In [41]:
# creating dataframe using dictionary of list with positional index
import pandas as pd
d1={'Rajesh':[89,68,91,88,75],'Seema':[68,89,78,72,84],'Rehan':[82,69,73,88,90]}
df5=pd.DataFrame(d1)
print(df5)

   Rajesh  Seema  Rehan
0      89     68     82
1      68     89     69
2      91     78     73
3      88     72     88
4      75     84     90

In [42]:
# creating dataframe using dictionary of list with labelled index
import pandas as pd
d1={'Rajesh':[89,68,91,88,75],'Seema':[68,89,78,72,84],'Rehan':[82,69,73,88,90]}
df5=pd.DataFrame(d1,index=['English','Maths','Science','SST','Hindi'])
print(df5)

         Rajesh  Seema  Rehan
English      89     68     82
Maths        68     89     69
Science      91     78     73
SST          88     72     88
Hindi        75     84     90

In [43]:
# we can change the column sequence by using column parameter in DataFrame() method. 
df5=pd.DataFrame(d1,columns=['Rajesh','Rehan','Seema'],index=['English','Maths','Science','SST','Hindi'])
print(df5)

         Rajesh  Rehan  Seema
English      89     82     68
Maths        68     69     89
Science      91     73     78
SST          88     88     72
Hindi        75     90     84

In [44]:
#creating dataframe using one series 
import pandas as pd
s1=pd.Series([2300,4500,5500,3600,4300],index=['jan','feb','march','april','may'])
df6=pd.DataFrame(s1)
print(df6)

          0
jan    2300
feb    4500
march  5500
april  3600
may    4300

In [45]:
#creating dataframe using series more than one series
import pandas as pd
s1=pd.Series([2300,4500,5500,3600,4300],index=['jan','feb','march','april','may'])
s2=pd.Series([2345,4567,5589,3643,4323],index=['jan','feb','march','april','may'])
s3=pd.Series([1211,1000,1502,1201,1430],index=['jan','feb','march','april','may'])
df6=pd.DataFrame([s1,s2,s3])
print(df6)

    jan   feb  march  april   may
0  2300  4500   5500   3600  4300
1  2345  4567   5589   3643  4323
2  1211  1000   1502   1201  1430

In [46]:
#creating dataframe using series with index parameter
import pandas as pd
s1=pd.Series([2300,4500,5500,3600,4300],index=['jan','feb','march','april','may'])
s2=pd.Series([2345,4567,5589,3643,4323],index=['jan','feb','march','april','may'])
s3=pd.Series([1211,1000,1502,1201,1430],index=['jan','feb','march','april','may'])
df6=pd.DataFrame([s1,s2,s3],index=['Food','Petrol','Clothes'])
print(df6)

          jan   feb  march  april   may
Food     2300  4500   5500   3600  4300
Petrol   2345  4567   5589   3643  4323
Clothes  1211  1000   1502   1201  1430

In [47]:
#creating dataframe using series with  different index parameter values
import pandas as pd
s1=pd.Series([2300,4500,5500,3600,4300],index=['jan','march','april','may', 'Sep'])
s2=pd.Series([2345,4567,5589,3643,4323],index=['jan','feb','march','april','may'])
s3=pd.Series([1211,1000,1502,1201,1430],index=['jan','feb','march','april','july'])
df6=pd.DataFrame([s1,s2,s3],index=['Food','Petrol','Clothes'])
print(df6)

            jan   march   april     may     Sep     feb    july
Food     2300.0  4500.0  5500.0  3600.0  4300.0     NaN     NaN
Petrol   2345.0  5589.0  3643.0  4323.0     NaN  4567.0     NaN
Clothes  1211.0  1502.0  1201.0     NaN     NaN  1000.0  1430.0

In [48]:
#creating dataframe using dictionary of series 
import pandas as pd
s1=pd.Series([2300,4500,5500,3600,4300],index=['Jan','March','April','May', 'Sep'])
s2=pd.Series([2345,4567,5589,3643,4323],index=['Jan','Feb','March','April','May'])
s3=pd.Series([1211,1000,1502,1201,1430],index=['Jan','Feb','March','April','July'])
dict1={'Food': s1,'Petrol':s2,'Clothes':s3}
df7=pd.DataFrame(dict1)
print(df7)

         Food  Petrol  Clothes
April  5500.0  3643.0   1201.0
Feb       NaN  4567.0   1000.0
Jan    2300.0  2345.0   1211.0
July      NaN     NaN   1430.0
March  4500.0  5589.0   1502.0
May    3600.0  4323.0      NaN
Sep    4300.0     NaN      NaN

In [49]:
#creating dataframe using dictionary of series
import pandas as pd
dict1={'Food': pd.Series([2300,4500,5500,3600,4300],index=['Jan','March','April','May', 'Sep']),
       'Petrol':pd.Series([2345,4567,5589,3643,4323],index=['Jan','Feb','March','April','May']),
       'Clothes':pd.Series([1211,1000,1502,1201,1430],index=['Jan','Feb','March','April','July'])}
df7=pd.DataFrame(dict1)
print(df7)

         Food  Petrol  Clothes
April  5500.0  3643.0   1201.0
Feb       NaN  4567.0   1000.0
Jan    2300.0  2345.0   1211.0
July      NaN     NaN   1430.0
March  4500.0  5589.0   1502.0
May    3600.0  4323.0      NaN
Sep    4300.0     NaN      NaN

In [50]:
#creating dataframe using dictionary of series with rows in order.
import pandas as pd
dict1={'Food': pd.Series([2300,4500,5500,3600,4300],index=['Jan','March','April','May', 'Sep']),
       'Petrol':pd.Series([2345,4567,5589,3643,4323],index=['Jan','Feb','March','April','May']),
       'Clothes':pd.Series([1211,1000,1502,1201,1430],index=['Jan','Feb','March','April','July'])}
df7=pd.DataFrame(dict1, index=['Jan','Feb','March','April','May','July','Sep'])
print(df7)

         Food  Petrol  Clothes
Jan    2300.0  2345.0   1211.0
Feb       NaN  4567.0   1000.0
March  4500.0  5589.0   1502.0
April  5500.0  3643.0   1201.0
May    3600.0  4323.0      NaN
July      NaN     NaN   1430.0
Sep    4300.0     NaN      NaN

In [51]:
import pandas as pd
d1={'Rajesh':[89,68,91,88,75],'Seema':[68,89,78,72,84],'Rehan':[82,69,73,88,90]}
df8=pd.DataFrame(d1,columns=['Rajesh','Rehan','Seema'],index=['English','Maths','Science','SST','Hindi'])
print(df8)

         Rajesh  Rehan  Seema
English      89     82     68
Maths        68     69     89
Science      91     73     78
SST          88     88     72
Hindi        75     90     84

In [52]:
# adding a new row in the dataframe using .loc[] method with label
df8.loc['IT']=[96,94,93]
print(df8)

         Rajesh  Rehan  Seema
English      89     82     68
Maths        68     69     89
Science      91     73     78
SST          88     88     72
Hindi        75     90     84
IT           96     94     93

In [62]:
# adding a new row in the dataframe using append method
import pandas as pd
print(pd.__version__)  # to check the version of pandas
L1=[51,62,73]
L2=[67,77,87]
data=[L1,L2]
df1 = pd.DataFrame(data, index=['French','Sanskrit'], columns=['Rajesh','Rehan','Seema'])
# print(df8.append(df1))   # This will work in older version 
print(pd.concat([df8,df1])) # in new version after 2.0 , this code will be used to add a new row in the existing dataframe

2.0.3
          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            96     94     93
French        51     62     73
Sanskrit      67     77     87
French        51     62     73
Sanskrit      67     77     87

In [63]:
# adding a new row in the dataframe using .loc[] method with index

df8.loc[6]=[96,94,93]
print(df8)

          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            96     94     93
French        51     62     73
Sanskrit      67     77     87
6             96     94     93

In [64]:
# adding a new row in the dataframe using .loc[] method with label
df8.loc['IT',:]=[96,94,93]
print(df8)

          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            96     94     93
French        51     62     73
Sanskrit      67     77     87
6             96     94     93

In [65]:
# .loc[] can also change the values ,if the index name is same as existing index.
df8.loc['IT']=[70,60,73]
df8

          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            70     60     73
French        51     62     73
Sanskrit      67     77     87
6             96     94     93

In [66]:
# .iloc[] can also be used to change the values of an already existing index
df8.iloc[6]=[11,22,33]
df8

          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            70     60     73
French        11     22     33
Sanskrit      67     77     87
6             96     94     93

In [67]:
# .loc[] method can be used to change the existing values to a common value if that row already exist
df8.loc[6]=45
df8

          Rajesh  Rehan  Seema
English       89     82     68
Maths         68     69     89
Science       91     73     78
SST           88     88     72
Hindi         75     90     84
IT            70     60     73
French        11     22     33
Sanskrit      67     77     87
6             45     45     45

In [68]:
# .loc[] method can also be used to change all the values 
df8.loc[:]=70
df8

          Rajesh  Rehan  Seema
English       70     70     70
Maths         70     70     70
Science       70     70     70
SST           70     70     70
Hindi         70     70     70
IT            70     70     70
French        70     70     70
Sanskrit      70     70     70
6             70     70     70

In [73]:
# adding a new row in the dataframe using append method
import pandas as pd 
df1 = pd.DataFrame(data=[4,5,6],index=['a','b','c'],columns=['A'])
df2 = pd.DataFrame(data=[14,15,16], index=['a','b','c'],columns=['A'])
# print(df2.append(df1))
print(pd.concat([df2,df1]))

    A
a  14
b  15
c  16
a   4
b   5
c   6

In [72]:
# adding a new row in the dataframe using append method by ignoring index
import pandas as pd 
df1 = pd.DataFrame(data=[4,5,6,7],index=['a','b','c','d'],columns=['A'])
df2 = pd.DataFrame(data=[14,15,16,17], index=['a','b','c','d'],columns=['A'])
# print(df2.append(df1,ignore_index=True))
print(pd.concat([df2,df1],ignore_index=True))

    A
0  14
1  15
2  16
3  17
4   4
5   5
6   6
7   7

In [74]:
# assume the dataframe given below for adding a column name 
import pandas as pd
d1={'Rajesh':[89,68,91,88,75],'Seema':[68,89,78,72,84],'Rehan':[82,69,73,88,90]}
df8=pd.DataFrame(d1,columns=['Rajesh','Rehan','Seema'],index=['English','Maths','Science','SST','Hindi'])
print(df8)

         Rajesh  Rehan  Seema
English      89     82     68
Maths        68     69     89
Science      91     73     78
SST          88     88     72
Hindi        75     90     84

In [75]:
# adding a column using insert method 
df8.insert(3,"Ruchi",[88,67,77,92,84])
df8

         Rajesh  Rehan  Seema  Ruchi
English      89     82     68     88
Maths        68     69     89     67
Science      91     73     78     77
SST          88     88     72     92
Hindi        75     90     84     84

In [76]:
# adding a column by assigning directly  
df8['Ashish']=[91,87,83,94,96]
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish
English      89     82     68     88      91
Maths        68     69     89     67      87
Science      91     73     78     77      83
SST          88     88     72     92      94
Hindi        75     90     84     84      96

In [77]:
# If the column already exists in the DataFrame then the assignment statement 
# will update the values of the already existing column
df8['Ashish']=[81,82,83,84,85]
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish
English      89     82     68     88      81
Maths        68     69     89     67      82
Science      91     73     78     77      83
SST          88     88     72     92      84
Hindi        75     90     84     84      85

In [78]:
# . loc[] method for creating a  new column
df8.loc[:,'Sonia']=[78,75,72,69,87]
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia
English      89     82     68     88      81     78
Maths        68     69     89     67      82     75
Science      91     73     78     77      83     72
SST          88     88     72     92      84     69
Hindi        75     90     84     84      85     87

In [79]:
#adding mutiple columns
df8[['Sheena','Reema']]=98
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Maths        68     69     89     67      82     75      98     98
Science      91     73     78     77      83     72      98     98
SST          88     88     72     92      84     69      98     98
Hindi        75     90     84     84      85     87      98     98

In [82]:
# Value error occurs when the values are mismatching.
df8.loc['CS']=[70,60,73,89,97,45,58,69]
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Maths        68     69     89     67      82     75      98     98
Science      91     73     78     77      83     72      98     98
SST          88     88     72     92      84     69      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69

In [85]:
# Value error occurs when the no of values are mismatching while adding a column
df8['AB']=[1,2,3,4,5,6,7,8]
df8

ValueError: Length of values (8) does not match length of index (6)

In [86]:
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Maths        68     69     89     67      82     75      98     98
Science      91     73     78     77      83     72      98     98
SST          88     88     72     92      84     69      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69

In [87]:
# to drop column Rehan 
df9=df8.drop('Rehan',axis=1)
df9

         Rajesh  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     68     88      81     78      98     98
Maths        68     89     67      82     75      98     98
Science      91     78     77      83     72      98     98
SST          88     72     92      84     69      98     98
Hindi        75     84     84      85     87      98     98
CS           70     73     89      97     45      58     69

In [88]:
# to drop row Science
df10=df9.drop('SST',axis=0)
df10

         Rajesh  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     68     88      81     78      98     98
Maths        68     89     67      82     75      98     98
Science      91     78     77      83     72      98     98
Hindi        75     84     84      85     87      98     98
CS           70     73     89      97     45      58     69

In [89]:
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Maths        68     69     89     67      82     75      98     98
Science      91     73     78     77      83     72      98     98
SST          88     88     72     92      84     69      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69

In [90]:
# to remove multiple columns from a dataframe
df10=df8.drop(['Rehan','Ruchi'],axis=1)
df10

         Rajesh  Seema  Ashish  Sonia  Sheena  Reema
English      89     68      81     78      98     98
Maths        68     89      82     75      98     98
Science      91     78      83     72      98     98
SST          88     72      84     69      98     98
Hindi        75     84      85     87      98     98
CS           70     73      97     45      58     69

In [91]:
# to remove multiple rows from a dataframe
df10=df8.drop(['Maths','SST'],axis=0)
df10

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Science      91     73     78     77      83     72      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69

In [92]:
df10.loc['Sanskrit']=[58,65,96,87,54,68,88,81]
df10=df10.rename({'Sanskrit': 'Hindi'},axis=0)
df10

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Science      91     73     78     77      83     72      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69
Hindi        58     65     96     87      54     68      88     81

In [93]:
df10=df10.drop('Hindi',axis='index')
df10

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Science      91     73     78     77      83     72      98     98
CS           70     60     73     89      97     45      58     69

In [94]:
df8

         Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
English      89     82     68     88      81     78      98     98
Maths        68     69     89     67      82     75      98     98
Science      91     73     78     77      83     72      98     98
SST          88     88     72     92      84     69      98     98
Hindi        75     90     84     84      85     87      98     98
CS           70     60     73     89      97     45      58     69

In [95]:
# to rename a row/ index in a Dataframe using axis parameter
df8=df8.rename({'English':'Eng'},axis=0)
df8=df8.rename({'SST':'Social Science'},axis=0)
df8

                Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
Eng                 89     82     68     88      81     78      98     98
Maths               68     69     89     67      82     75      98     98
Science             91     73     78     77      83     72      98     98
Social Science      88     88     72     92      84     69      98     98
Hindi               75     90     84     84      85     87      98     98
CS                  70     60     73     89      97     45      58     69

In [96]:
# to rename a row/ index in a Dataframe using index parameter
df8=df8.rename(index={'Maths':'Mathematics'})
df8

                Rajesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
Eng                 89     82     68     88      81     78      98     98
Mathematics         68     69     89     67      82     75      98     98
Science             91     73     78     77      83     72      98     98
Social Science      88     88     72     92      84     69      98     98
Hindi               75     90     84     84      85     87      98     98
CS                  70     60     73     89      97     45      58     69

In [97]:
# to rename a column in  a Dataframe using axis parameter
df8=df8.rename({'Rajesh':'Ramesh'},axis=1)
df8

                Ramesh  Rehan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
Eng                 89     82     68     88      81     78      98     98
Mathematics         68     69     89     67      82     75      98     98
Science             91     73     78     77      83     72      98     98
Social Science      88     88     72     92      84     69      98     98
Hindi               75     90     84     84      85     87      98     98
CS                  70     60     73     89      97     45      58     69

In [98]:
# to rename a column in a Dataframe using index parameter
df8=df8.rename(columns={'Rehan':'Rohan'})
df8

                Ramesh  Rohan  Seema  Ruchi  Ashish  Sonia  Sheena  Reema
Eng                 89     82     68     88      81     78      98     98
Mathematics         68     69     89     67      82     75      98     98
Science             91     73     78     77      83     72      98     98
Social Science      88     88     72     92      84     69      98     98
Hindi               75     90     84     84      85     87      98     98
CS                  70     60     73     89      97     45      58     69

In [99]:
df8=df8.rename({'Seema':'Samiksha','Ruchi':'Roohi','Sonia': 'Sakshi',
                'Sheena':'Shikha','Reema':'Ridhika'},axis=1)
df8

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Mathematics,68,69,89,67,82,75,98,98
Science,91,73,78,77,83,72,98,98
Social Science,88,88,72,92,84,69,98,98
Hindi,75,90,84,84,85,87,98,98
CS,70,60,73,89,97,45,58,69

In [100]:
# Indexing using index operator for showing a specific column
df8['Rohan']

Eng               82
Mathematics       69
Science           73
Social Science    88
Hindi             90
CS                60
Name: Rohan, dtype: int64

In [101]:
# Indexing a column using .loc
df8.loc[:,'Rohan']

Eng               82
Mathematics       69
Science           73
Social Science    88
Hindi             90
CS                60
Name: Rohan, dtype: int64

In [102]:
# indexing  more than one row using .loc
df8.loc[['Science','Hindi']]

         Ramesh  Rohan  Samiksha  Roohi  Ashish  Sakshi  Shikha  Ridhika
Science      91     73        78     77      83      72      98       98
Hindi        75     90        84     84      85      87      98       98

In [103]:
# Indexing using .loc[] for showing specific row
df8.loc['Hindi']

Ramesh      75
Rohan       90
Samiksha    84
Roohi       84
Ashish      85
Sakshi      87
Shikha      98
Ridhika     98
Name: Hindi, dtype: int64

In [104]:
# Indexing using .loc[] for showing specific row and specific column
df8.loc['Hindi','Roohi']

84

In [105]:
# Indexing using .iloc[] for showing specific row
df9 = pd.DataFrame([[121,125,130,140,150],[1,2,3,4,5],[11,12,13,14,15]])
df9

     0    1    2    3    4
0  121  125  130  140  150
1    1    2    3    4    5
2   11   12   13   14   15

In [106]:
# Indexing using .iloc[] for showing specific row
df9.iloc[2]

0    11
1    12
2    13
3    14
4    15
Name: 2, dtype: int64

In [107]:
# Indexing using [] index operator for showing specific row
df9[1]

0    125
1      2
2     12
Name: 1, dtype: int64

In [108]:
# Indexing using .iloc[] for showing specific row and specific column
df9.iloc[0,2] # here 0th row and 2nd column

130

In [109]:
df8

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Mathematics,68,69,89,67,82,75,98,98
Science,91,73,78,77,83,72,98,98
Social Science,88,88,72,92,84,69,98,98
Hindi,75,90,84,84,85,87,98,98
CS,70,60,73,89,97,45,58,69

In [110]:
# Creating a boolean condition for column
df8['Rohan'] > 80

Eng                True
Mathematics       False
Science           False
Social Science     True
Hindi              True
CS                False
Name: Rohan, dtype: bool

In [111]:
# Creating a boolean condition for column
df8.loc[:,'Rohan'] > 80

Eng                True
Mathematics       False
Science           False
Social Science     True
Hindi              True
CS                False
Name: Rohan, dtype: bool

In [112]:
# Creating a boolean condition for row
df8.loc['Science'] > 80

Ramesh       True
Rohan       False
Samiksha    False
Roohi       False
Ashish       True
Sakshi      False
Shikha       True
Ridhika      True
Name: Science, dtype: bool

In [113]:
# Creating a boolean condition for column by creating a separate dataframe 
df8[df8['Roohi'] > 85]

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Social Science,88,88,72,92,84,69,98,98
CS,70,60,73,89,97,45,58,69

In [114]:
# Multiple conditions  for boolean indexing

dfnew = df8[(df8['Roohi'] > 85) & (df8['Sakshi'] < 90)]
dfnew

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Social Science,88,88,72,92,84,69,98,98
CS,70,60,73,89,97,45,58,69

In [115]:
df8['Sakshi'] < 90

Eng               True
Mathematics       True
Science           True
Social Science    True
Hindi             True
CS                True
Name: Sakshi, dtype: bool

In [116]:
# row slicing using iloc
df8.iloc[2:4]

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Science,91,73,78,77,83,72,98,98
Social Science,88,88,72,92,84,69,98,98

In [117]:
# row slicing using loc
df8.loc['Eng':'Science']

             Ramesh  Rohan  Samiksha  Roohi  Ashish  Sakshi  Shikha  Ridhika
Eng              89     82        68     88      81      78      98       98
Mathematics      68     69        89     67      82      75      98       98
Science          91     73        78     77      83      72      98       98

In [121]:
# column Slicing by label using index operator 
df8[['Rohan','Ashish']]

                Rohan  Ashish
Eng                82      81
Mathematics        69      82
Science            73      83
Social Science     88      84
Hindi              90      85
CS                 60      97

In [122]:
# column slicing using iloc
df8.iloc[:,2:5]

                Samiksha  Roohi  Ashish
Eng                   68     88      81
Mathematics           89     67      82
Science               78     77      83
Social Science        72     92      84
Hindi                 84     84      85
CS                    73     89      97

In [123]:
# Slicing both rows and columns simultaneously
df8.iloc[1:4, 2:5]  # Rows 2-4, Columns 3-5

                Samiksha  Roohi  Ashish
Mathematics           89     67      82
Science               78     77      83
Social Science        72     92      84

In [124]:
# Slicing both rows and columns simultaneously
df8.loc["Mathematics":"Social Science", "Samiksha":"Ashish"]  # Rows 2-4, Columns 3-5

                Samiksha  Roohi  Ashish
Mathematics           89     67      82
Science               78     77      83
Social Science        72     92      84

In [125]:
# Slicing both rows but specific columns simultaneously
df8.loc["Mathematics":"Social Science",[ "Samiksha","Ashish"]]  # Rows 2-4, Columns 3-5

                Samiksha  Ashish
Mathematics           89      82
Science               78      83
Social Science        72      84

In [126]:
# printing dataframe df8 already created
df8

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Mathematics,68,69,89,67,82,75,98,98
Science,91,73,78,77,83,72,98,98
Social Science,88,88,72,92,84,69,98,98
Hindi,75,90,84,84,85,87,98,98
CS,70,60,73,89,97,45,58,69

In [129]:
# Filtering using .loc method
df8.loc[[True, False, True, True, False,True]]

,Ramesh,Rohan,Samiksha,Roohi,Ashish,Sakshi,Shikha,Ridhika
Eng,89,82,68,88,81,78,98,98
Science,91,73,78,77,83,72,98,98
Social Science,88,88,72,92,84,69,98,98
CS,70,60,73,89,97,45,58,69

In [130]:
#Joining, Merging and Concatenation of DataFrames
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R2','R4','R5'])

# Append df2 below df1
dfNew = pd.concat([df1,df2])
dfNew

    Productid      Name  Price
R1        101      Soap     78
R2        102   Biscuit     59
R3        103  Notebook    145
R2        104       Pen    315
R4        105    Pencil     29
R5        106    Eraser     45

In [132]:
#Joining, Merging and Concatenation of DataFrames
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R2','R4','R5'])

# Append df2 below df1 using parameter ignore_index
dfNew = pd.concat([df1,df2], ignore_index=True)
dfNew

   Productid      Name  Price
0        101      Soap     78
1        102   Biscuit     59
2        103  Notebook    145
3        104       Pen    315
4        105    Pencil     29
5        106    Eraser     45

In [133]:
#Joining, Merging and Concatenation of DataFrames
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R2','R4','R5'])

# Append df2 below df1 using parameter ignore_index
dfNew = pd.concat([df1,df2], ignore_index=False)
dfNew

    Productid      Name  Price
R1        101      Soap     78
R2        102   Biscuit     59
R3        103  Notebook    145
R2        104       Pen    315
R4        105    Pencil     29
R5        106    Eraser     45

In [134]:
#Joining, Merging and Concatenation of DataFrames
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R1','R4','R5'])

# Append df2 below df1 using parameter verify_integrity
dfNew = pd.concat([df1,df2], verify_integrity=True)
dfNew

ValueError: Indexes have overlapping values: Index(['R1'], dtype='object')

In [135]:
#Joining, Merging and Concatenation of DataFrames
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R2','R4','R5'])

# Append df2 below df1 using parameter ignore_index
dfNew = pd.concat([df1,df2], sort=True)
dfNew

        Name  Price  Productid
R1      Soap     78        101
R2   Biscuit     59        102
R3  Notebook    145        103
R2       Pen    315        104
R4    Pencil     29        105
R5    Eraser     45        106

In [136]:
# joining dataframes
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Company': ['Godrej','Parle','Camel']}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R1','R2','R3'])
dfJ = df1.join(df2)  # Joining df1 with df2 based on their indices (inner join)
dfJ

    Productid      Name  Price Company
R1        101      Soap     78  Godrej
R2        102   Biscuit     59   Parle
R3        103  Notebook    145   Camel

In [137]:
# Merging dataframes
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [101, 102, 103],'Company': ['Godrej','Parle','Camel']}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R1','R2','R3'])
# Merging df1 with df2 based on their indices (inner join)
dfM =pd.merge(df1, df2, on='Productid', how='inner')  
dfM

   Productid      Name  Price Company
0        101      Soap     78  Godrej
1        102   Biscuit     59   Parle
2        103  Notebook    145   Camel

In [138]:
# Concatenating  dataframes
import pandas as pd

# Sample DataFrames
d1 = {'Productid': [101, 102, 103], 'Name': ['Soap', 'Biscuit', 'Notebook'],'Price':[78,59,145]}
d2 = {'Productid': [104, 105, 106], 'Name': ['Pen', 'Pencil', 'Eraser'],'Price':[315,29,45]}
df1 = pd.DataFrame(d1,index=['R1','R2','R3'])
df2 = pd.DataFrame(d2, index=['R1','R4','R5'])
dfC =pd.concat([df1, df2], axis=1)  # concatenating df1 with df2 
dfC

    Productid      Name  Price  Productid    Name  Price
R1      101.0      Soap   78.0      104.0     Pen  315.0
R2      102.0   Biscuit   59.0        NaN     NaN    NaN
R3      103.0  Notebook  145.0        NaN     NaN    NaN
R4        NaN       NaN    NaN      105.0  Pencil   29.0
R5        NaN       NaN    NaN      106.0  Eraser   45.0

In [139]:
import pandas as pd

# Sample patient data
data = {
    'Patient_ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [35, 28, 40, 45, 22],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
    'Diagnosis': ['Flu', 'Fracture', 'Migraine', 'COVID-19', 'Allergy'],
    'Admitted_Date': ['2023-01-05', '2023-02-15', '2023-03-20', '2023-04-10', '2023-05-12']
}

# Creating a DataFrame from the patient data
dfP = pd.DataFrame(data)
dfP

   Patient_ID     Name  Age  Gender Diagnosis Admitted_Date
0           1    Alice   35  Female       Flu    2023-01-05
1           2      Bob   28    Male  Fracture    2023-02-15
2           3  Charlie   40    Male  Migraine    2023-03-20
3           4    David   45    Male  COVID-19    2023-04-10
4           5      Eva   22  Female   Allergy    2023-05-12

In [140]:
dfP.shape

(5, 6)

In [141]:
dfP.columns

Index(['Patient_ID', 'Name', 'Age', 'Gender', 'Diagnosis', 'Admitted_Date'], dtype='object')

In [142]:
dfP.index

RangeIndex(start=0, stop=5, step=1)

In [143]:
dfP.values

array([[1, 'Alice', 35, 'Female', 'Flu', '2023-01-05'],
       [2, 'Bob', 28, 'Male', 'Fracture', '2023-02-15'],
       [3, 'Charlie', 40, 'Male', 'Migraine', '2023-03-20'],
       [4, 'David', 45, 'Male', 'COVID-19', '2023-04-10'],
       [5, 'Eva', 22, 'Female', 'Allergy', '2023-05-12']], dtype=object)

In [144]:
dfP.dtypes

Patient_ID        int64
Name             object
Age               int64
Gender           object
Diagnosis        object
Admitted_Date    object
dtype: object

In [145]:
dfP.size

30

In [146]:
print(dfP.head(3))
print(dfP.head())

   Patient_ID     Name  Age  Gender Diagnosis Admitted_Date
0           1    Alice   35  Female       Flu    2023-01-05
1           2      Bob   28    Male  Fracture    2023-02-15
2           3  Charlie   40    Male  Migraine    2023-03-20
   Patient_ID     Name  Age  Gender Diagnosis Admitted_Date
0           1    Alice   35  Female       Flu    2023-01-05
1           2      Bob   28    Male  Fracture    2023-02-15
2           3  Charlie   40    Male  Migraine    2023-03-20
3           4    David   45    Male  COVID-19    2023-04-10
4           5      Eva   22  Female   Allergy    2023-05-12

In [147]:
print(dfP.tail(4))
print(dfP.tail())

   Patient_ID     Name  Age  Gender Diagnosis Admitted_Date
1           2      Bob   28    Male  Fracture    2023-02-15
2           3  Charlie   40    Male  Migraine    2023-03-20
3           4    David   45    Male  COVID-19    2023-04-10
4           5      Eva   22  Female   Allergy    2023-05-12
   Patient_ID     Name  Age  Gender Diagnosis Admitted_Date
0           1    Alice   35  Female       Flu    2023-01-05
1           2      Bob   28    Male  Fracture    2023-02-15
2           3  Charlie   40    Male  Migraine    2023-03-20
3           4    David   45    Male  COVID-19    2023-04-10
4           5      Eva   22  Female   Allergy    2023-05-12

In [148]:
dfP.describe()

       Patient_ID        Age
count    5.000000   5.000000
mean     3.000000  34.000000
std      1.581139   9.192388
min      1.000000  22.000000
25%      2.000000  28.000000
50%      3.000000  35.000000
75%      4.000000  40.000000
max      5.000000  45.000000

In [149]:
dfP.T

                        0           1           2           3           4
Patient_ID              1           2           3           4           5
Name                Alice         Bob     Charlie       David         Eva
Age                    35          28          40          45          22
Gender             Female        Male        Male        Male      Female
Diagnosis             Flu    Fracture    Migraine    COVID-19     Allergy
Admitted_Date  2023-01-05  2023-02-15  2023-03-20  2023-04-10  2023-05-12

In [150]:
dfP.empty

False

In [151]:
df=pd.DataFrame()
df.empty

True

In [162]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame
df = pd.read_csv('C:/Users/psaxe/doctor.csv')

# Displaying the DataFrame
print(df)

         Name  Age        City
0   Dr. Patel   35      Mumbai
1  Dr. Sharma   40       Delhi
2   Dr. Singh   32   Bangalore
3   Dr. Goyal   41      Jaipur
4   Dr. Gupta   43       Delhi

In [ ]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame with  sep and header parameter
df = pd.read_csv('C:/Users/suvig/doctor.csv',sep =",", header=0)

# Displaying the DataFrame
print(df)

In [ ]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame with sep and header parameter
df = pd.read_csv('C:/Users/suvig/doctor.csv',sep =",", header=1)

# Displaying the DataFrame
print(df)

In [154]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame with sep , header and names  parameter
df = pd.read_csv('C:/Users/psaxe/doctor.csv',sep =",", header=0, names=['Doctor Name','D_Age','D_City'])

# Displaying the DataFrame having only 2 columns
print(df)

  Doctor Name  D_Age      D_City
0   Dr. Patel     35      Mumbai
1  Dr. Sharma     40       Delhi
2   Dr. Singh     32   Bangalore
3   Dr. Goyal     41      Jaipur
4   Dr. Gupta     43       Delhi

In [157]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame with sep , header and usecols  parameter 
df = pd.read_csv('C:/Users/psaxe/doctor.csv',sep =",", header=0, usecols=[0,1])

# Displaying the DataFrame having only 2 columns
print(df)

         Name  Age
0   Dr. Patel   35
1  Dr. Sharma   40
2   Dr. Singh   32
3   Dr. Goyal   41
4   Dr. Gupta   43

In [158]:
# importing data from CSV file in a dataframe
import pandas as pd

# Reading the CSV file into a DataFrame with sep , header, usecols and nrows parameter
df = pd.read_csv('C:/Users/psaxe/doctor.csv',sep =",", header=0, usecols=[0,1],nrows=3)

# Displaying the DataFrame having only 2 columns
print(df)

         Name  Age
0   Dr. Patel   35
1  Dr. Sharma   40
2   Dr. Singh   32

In [159]:
# Exporting data from dataframe to CSV file
import pandas as pd

# copying the DataFrame into a csv file
df.to_csv(path_or_buf='C:/Users/psaxe/Newdoctor.csv',sep =",")

In [160]:
# Exporting data from dataframe to txt file
import pandas as pd

# copying the DataFrame into a Txt file with sep , header and index parameter
df.to_csv(path_or_buf='C:/Users/psaxe/Newfile.txt',sep = '@', header = False, index= False)

In [161]:
import pandas as pd
ld = [{'prodname':'brush','price':158,'discount':45},{'prodname':'toothpaste','price':78,'discount':20},{'prodname':'soap','price':74,'discount':15}]
d1=pd.DataFrame(ld,index=['401','402','403'])
d1['city']=['jaipur','alwar','kota']  # city is added as column
d1.loc['404']=['tea',345,54,'surat']   # row is added
# d2=d1.drop(['discount'],axis=1)
d2=d1.drop(['404'],axis=0)
d3=d2.rename({'401':'pr401','402': 'pr402','403': 'pr403','404': 'pr404'},axis=0)
d4=d3.rename({'prodname':'prname','price': 'prodprice','city': 'prodcity'},axis=1)
print(d1)
print(d2)

       prodname  price  discount    city
401       brush    158        45  jaipur
402  toothpaste     78        20   alwar
403        soap     74        15    kota
404         tea    345        54   surat
       prodname  price  discount    city
401       brush    158        45  jaipur
402  toothpaste     78        20   alwar
403        soap     74        15    kota